#
#
# #整型
# a =12345678900123456789
# b= a*a
# print(b)
# # a = 0b11
# # a =0o11
# a =0x1f
# print(a)
#
# # 浮点型
# x = 1.34
# print(x)
#
# # 指数
# y = 5.843e2
# print(y)
#
# # 字符型
# # n = 'Hello Python'
# # print(n)
#
# n = '123'
# print(type(n))
# n = int(n) #类型转换
# print(type(n))
#
# #单、双、三引号
# print('''
#             **************                       ****        ****                *****         *****
#                 ****                            ******      ******                 ****       ****
#                 ****                           ********    ********                 ***      ***
#                 ****                           *******************                    **   **
#                 ****                             ****************                      ******
#                 ****                               ************                         ****
#                 ****                                 ********                           ****
#                 ****                                   ****                             ****
#             **************                              **                              ****
# ''')
#
#
#
#
#
# # stu = input("请输入你的学号：")
# # name = input("请输入你的姓名：")
# #
# # print(f"学号：{stu},\n姓名：{name}")
#
#
# #封装函数
# # def print_stu():
# #     stu = input("请输入你的学号：")
# #     name = input("请输入你的姓名：")
# #     print(f"学号：{stu},\n姓名：{name}")
#
# # print_stu()
#
#
#
# #引用模块
# from name_modul import print_stu
# print_stu()
#







































